### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd

In [3]:
# File to Load (Remember to Change These)
file= "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
gamer_df= pd.read_csv(file)

In [4]:
gamer_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

## Player Count

* Display the total number of players

In [5]:
Players=gamer_df[["SN"]].value_counts()
Players

SN
Lisosia93       5
Iral74          4
Idastidru52     4
Aina42          3
Iri67           3
               ..
Lisossala30     1
Lisossanya98    1
Lisotesta51     1
Lisovynya38     1
Adairialis76    1
Length: 576, dtype: int64

In [6]:
Total_Players = pd.DataFrame({"Total Players":[576]})
Total_Players

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
number_purchases =gamer_df["Purchase ID"].value_counts()
number_purchases

779    1
243    1
265    1
264    1
263    1
      ..
517    1
516    1
515    1
514    1
0      1
Name: Purchase ID, Length: 780, dtype: int64

In [8]:
average_price= round(gamer_df["Price"].mean(),2)
average_price

3.05

In [9]:
total_revenue= gamer_df["Price"].sum()
total_revenue

2379.77

In [10]:
unique_items= gamer_df["Item Name"].value_counts()
unique_items

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Persuasion                                       9
Extraction, Quickblade Of Trembling Hands        9
Nirvana                                          9
                                                ..
Riddle, Tribute of Ended Dreams                  1
Alpha, Reach of Ending Hope                      1
Endbringer                                       1
The Decapitator                                  1
Celeste                                          1
Name: Item Name, Length: 179, dtype: int64

In [11]:
Purchasing_Analysis = pd.DataFrame({"Number of Unique Items":[179], "Average Price": ["$3.05"], "Number of Purchases":[780], "Total Revenue": ["$2,379.77"]})
Purchasing_Analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [12]:
#count of Genders
gender= gamer_df["Gender"].value_counts()
gender

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [13]:
#Total count of All genders
total = gender.sum()
total

780

In [14]:
#Summary of Gender Count and Percentage of players
gender_count_df =round(pd.DataFrame({"Total Count": gender,"Percentage of Players":[(652/780)*100,(113/780)*100,(15/780)*100]}),2)
gender_count_df

                       Total Count  Percentage of Players
Male                           652                  83.59
Female                         113                  14.49
Other / Non-Disclosed           15                   1.92

In [15]:
#Alternative way of showing the same data

Gender_Demo= round(pd.DataFrame({"":["Male","Female","Other/Non Disclosed"], 
                           "Total Count":[652, 113, 15],
                           "Percentage of Players":[(652/780)*100,(113/780)*100,(15/780)*100]
                          }),2)
Gender_Demo

                        Total Count  Percentage of Players
0                 Male          652                  83.59
1               Female          113                  14.49
2  Other/Non Disclosed           15                   1.92

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [16]:
purchasing_df= gamer_df[["Gender","Price"]]
purchasing_df.head()

  Gender  Price
0   Male   3.53
1   Male   1.56
2   Male   4.88
3   Male   3.27
4   Male   1.44

In [17]:
purchase_group= purchasing_df.groupby(["Gender"])
average_price_df= round(purchase_group.mean(),2)
average_price_df

                       Price
Gender
Female                  3.20
Male                    3.02
Other / Non-Disclosed   3.35

In [18]:
total_price_df= purchase_group.sum()
total_price_df

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [19]:
Purchasing_Analysis_df=pd.DataFrame({"Gender":["Male","Female","Other/Non Disclosed"], 
                           "Purchase Count":[652, 113, 15],
                           "Average Purchase Price":[3.02,3.20,3.35],
                            "Total Purchase Value":["$1967.64","$361.94","$50.19"]
                          })
Purchasing_Analysis_df

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value
0,Male,652,3.02,$1967.64
1,Female,113,3.20,$361.94
2,Other/Non Disclosed,15,3.35,$50.19

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [20]:
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [21]:
#created Bins in which data will be held
bins =[0,9,14,19,24,29,34,39,50]

#names for bins

age_groups = ["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [22]:
gamer_df["Age Ranges"]=pd.cut(gamer_df["Age"],bins,labels=age_groups, include_lowest= True)
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [28]:
gamer_df[["Age Ranges","Age"]].head()

  Age Ranges  Age
0      20-24   20
1        40+   40
2      20-24   24
3      20-24   24
4      20-24   23

In [30]:
#Group by age ranges
age_ranges_df=gamer_df.groupby("Age Ranges")
age_ranges_df["Age"].count()

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64

In [72]:
#Data Frame
Demographic_Summary_df=round(pd.DataFrame({"":["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"], 
                                     "Total Count":[23,28,136,365,101,73,41,13],
                                    "Percentage of Players":[(23/780)*100,(28/780)*100,(136/780)*100,(365/780)*100,(101/780)*100,(73/780)*100,(41/780)*100,(13/780)*100],
                                   }),2)
                        
Demographic_Summary_df

          Total Count  Percentage of Players
0    <10           23                   2.95
1  10-14           28                   3.59
2  15-19          136                  17.44
3  20-24          365                  46.79
4  25-29          101                  12.95
5  30-34           73                   9.36
6  35-39           41                   5.26
7    40+           13                   1.67

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [31]:
#created Bins in which data will be held
bins =[0,9,14,19,24,29,34,39,50]

#names for bins

ages_df = ["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [32]:
gamer_df["Age Ranges"]=pd.cut(gamer_df["Age"],bins,labels=age_groups, include_lowest= True)
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [34]:
money_df=gamer_df[["Age Ranges","Price"]]
money_df.head()

  Age Ranges  Price
0      20-24   3.53
1        40+   1.56
2      20-24   4.88
3      20-24   3.27
4      20-24   1.44

In [35]:
Follow_the_money_df= money_df.groupby(["Age Ranges"])
Follow_the_money_df.sum()

              Price
Age Ranges
<10           77.13
10-14         82.78
15-19        412.89
20-24       1114.06
25-29        293.00
30-34        214.00
35-39        147.67
40+           38.24

In [36]:
round(Follow_the_money_df.mean(),2)

            Price
Age Ranges
<10          3.35
10-14        2.96
15-19        3.04
20-24        3.05
25-29        2.90
30-34        2.93
35-39        3.60
40+          2.94

In [37]:
Money_Talks_df=pd.DataFrame({"Age Ranges":["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"], 
                           "Purchase Count":[23,28,136,365,101,73,41,13],
                           "Average Purchase Price":["$3.35","2.96","$3.04","$3.05","$2.90","$2.93","$3.60","$2.94"],
                            "Total Purchase Value":["$77.13","$82.78","$412.89","$1,114.06","$293.00","$214.00","$147.67", "$38.24"]
                          })
Money_Talks_df

  Age Ranges  Purchase Count Average Purchase Price Total Purchase Value
0        <10              23                  $3.35               $77.13
1      10-14              28                   2.96               $82.78
2      15-19             136                  $3.04              $412.89
3      20-24             365                  $3.05            $1,114.06
4      25-29             101                  $2.90              $293.00
5      30-34              73                  $2.93              $214.00
6      35-39              41                  $3.60              $147.67
7        40+              13                  $2.94               $38.24

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [130]:
#Uniqe SN name
name_df= gamer_df[["SN","Price","Item Name"]]
name_df.value_counts()

SN            Price  Item Name
Zontibe81     3.79   Arcane Gem                                   1
Frichjask31   4.43   Deluge, Edge of the West                     1
Haisrisuir60  4.19   Final Critic                                 1
              2.67   Abyssal Shard                                1
Haillyrgue51  4.60   Dawn                                         1
                                                                 ..
Marokian45    3.53   Extraction, Quickblade Of Trembling Hands    1
Marjask87     1.44   Suspension                                   1
Marirrasta50  4.66   Endbringer                                   1
Marim28       3.33   Lifebender                                   1
Adairialis76  2.28   Twilight's Carver                            1
Length: 780, dtype: int64

In [131]:
#creat dataframe of the average for each screen name
sn_group =name_df.groupby(["SN"])

cost_breakdown_df= round(sn_group.mean(),2)
cost_breakdown_df

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      2.07
Yathedeu43      3.01
Yoishirrala98   4.58
Zhisrisu83      3.94
Zontibe81       2.68

[576 rows x 1 columns]

In [132]:
cost_breakdown_df=sn_group.sum()
cost_breakdown_df

               Price
SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
...              ...
Yathecal82      6.22
Yathedeu43      6.02
Yoishirrala98   4.58
Zhisrisu83      7.89
Zontibe81       8.03

[576 rows x 1 columns]

In [135]:
cost_breakdown_df=sn_group.count()
cost_breakdown_df

               Price  Item Name
SN
Adairialis76       1          1
Adastirin33        1          1
Aeda94             1          1
Aela59             1          1
Aelaria33          1          1
...              ...        ...
Yathecal82         3          3
Yathedeu43         2          2
Yoishirrala98      1          1
Zhisrisu83         2          2
Zontibe81          3          3

[576 rows x 2 columns]

In [119]:
sort_df = cost_breakdown_df.sort_values("Price",ascending=False )
sort_df.head()

                Purchase ID   Age  Item ID  Price  Total Purchas value
SN
Dyally87              554.0  22.0     63.0   4.99               643.99
Yarithsurgue62        231.0  26.0    139.0   4.94               400.94
Chanirrasta87         493.0  14.0    139.0   4.94               650.94
Lirtilsa71            246.0  24.0    139.0   4.94               413.94
Ririp86               110.0  25.0    139.0   4.94               278.94

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [212]:
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [213]:
ID= gamer_df[["Item ID","Item Name"]].value_counts()
ID.head(10)

Item ID  Item Name
92       Final Critic                                    13
178      Oathbreaker, Last Hope of the Breaking Storm    12
108      Extraction, Quickblade Of Trembling Hands        9
132      Persuasion                                       9
82       Nirvana                                          9
145      Fiery Glass Crusader                             9
60       Wolf                                             8
34       Retribution Axe                                  8
37       Shadow Strike, Glory of Ending Hope              8
59       Lightning, Etcher of the King                    8
dtype: int64

In [241]:
items=gamer_df[["Item ID","Item Name","Price"]]
items.value_counts()

Item ID  Item Name                                     Price
178      Oathbreaker, Last Hope of the Breaking Storm  4.23     12
145      Fiery Glass Crusader                          4.58      9
82       Nirvana                                       4.90      9
108      Extraction, Quickblade Of Trembling Hands     3.53      9
34       Retribution Axe                               2.22      8
                                                                ..
90       Betrayer                                      2.94      1
42       The Decapitator                               1.75      1
47       Alpha, Reach of Ending Hope                   3.58      1
51       Endbringer                                    4.66      1
91       Celeste                                       4.17      1
Length: 183, dtype: int64

In [243]:
#Item Count
item_group=items.groupby(["Item ID","Item Name"])
item_id= item_group.count()
item_id

                                                      Price
Item ID Item Name
0       Splinter                                          4
1       Crucifer                                          4
2       Verdict                                           6
3       Phantomlight                                      6
4       Bloodlord's Fetish                                5
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm     12
179     Wolf, Promise of the Moonwalker                   6
181     Reaper's Toll                                     5
182     Toothpick                                         3
183     Dragon's Greatsword                               3

[179 rows x 1 columns]

In [244]:
#Item average price
item_id=item_group.mean()
item_id

                                                       Price
Item ID Item Name
0       Splinter                                      1.2800
1       Crucifer                                      2.9425
2       Verdict                                       2.4800
3       Phantomlight                                  2.4900
4       Bloodlord's Fetish                            1.7000
...                                                      ...
178     Oathbreaker, Last Hope of the Breaking Storm  4.2300
179     Wolf, Promise of the Moonwalker               4.4800
181     Reaper's Toll                                 1.6600
182     Toothpick                                     4.0300
183     Dragon's Greatsword                           1.0900

[179 rows x 1 columns]

In [245]:
#Item total price 
item_id=item_group.sum()
item_id

                                                      Price
Item ID Item Name
0       Splinter                                       5.12
1       Crucifer                                      11.77
2       Verdict                                       14.88
3       Phantomlight                                  14.94
4       Bloodlord's Fetish                             8.50
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm  50.76
179     Wolf, Promise of the Moonwalker               26.88
181     Reaper's Toll                                  8.30
182     Toothpick                                     12.09
183     Dragon's Greatsword                            3.27

[179 rows x 1 columns]

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80